{
	"bb001":"Select <strong>Enterprise Users</strong> option if the Bot is for enterprise managed users and to define how billing is applied. Employee Bots require a user profile as well as enterprise admin assignment to use the Bot. Select <strong>General Public</strong> option for general Bot consumer use. <a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/getting-started-bots/defining-a-standard-bot/'>More...</a>",
	"bb002":"For each standard response category tab, the event or user input is listed followed by one or more NLP interpreter standard responses. You can modify the default response, and if needed, add additional responses selected randomly by the NLP interpreter in response to a user input or system event.In the <strong>Standard Response</strong> section, the standard bot responses are categorized in the following tabs:<ul><li><strong>Statements</strong> - Responses displayed to the user as the result of an action by the bot or user. For example, a user cancels a task, or a users gives an invalid response to your bot request.</li><li><strong>Queries</strong> - Statements from the bot to the user to ask for more information, for example, <em>Which field do you want to change?</em></li><li><strong>Error &amp; Warnings</strong> - Statements from the bot to the user when an error occurs during the scenario, such as <em>End date cannot be before or same as the start date!</em></li><li><strong>Choices</strong> - The bot is asking for Yes/No input, for example, <em>Would you like to receive push notifications every time this task occurs?</em></li><li><strong>Greeting</strong> - Initial responses by the bot when the bot is installed, or other initial contacts, for example, when a user returns to the interaction after a period of inactivity.</li><li><strong>Questions</strong> - Questions the Bot may pose to the user when not included in any other category.</li></ul><a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/optimizing-bots/managing-chat-responses#bb002'>More...</a>",
	"bb003":"",
	"bb004":"",
	"bb005":"You can use Machine Learning to teach the interpreter to recognize a user intent for a specific user utterance. When you use this option, you are adding the recognized user utterance or user input as a match for a specific task. For example, if the user utterance is <em>What is the weather today?</em>, you could use Machine Learning to associate the user input with the <em>Current Conditions</em> task. <a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/optimizing-bots/testing-your-bot-with-nlp#bb005'>More...</a>",
	"bb006":"Concepts are are clusters of related and synonymous terms that we want considered as a group identified by a single term. You can define a new concept starting with a ~. Concepts can be used in defining patterns. <a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/optimizing-bots/testing-your-bot-with-nlp#bb006'>More...</a>",
	"bb007":"You can add patterns for the task name to teach the interpreter to recognize the correct user intent based on the recognized user input. For example, if the user utterance is <em>What is the weather report for today?</em>, you could add the <em>weather today</em> pattern in the <em>Current Conditions</em> task. This pattern would match basically any user input that contained the words <em>weather</em> or <em>today</em>. A pattern is list of base form words that infers the meaning of the user input. <a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/optimizing-bots/managing-patterns'>More...</a>",
	"bb008":"",
	"bb009":"",
	"bb010":"",
	"bb011":"",
	"bb012":"Enter the text message to display to the end-user at the start of a new conversation with the Bot, for example, <i>Hello there, I am the virtual assistant. How can I help you.</i>.",
	"bb013":"",
    "bb015":"After you have defined and saved a new configuration for a Kore.ai task in Bot Builder, the task is displayed on the <strong>Bot Builder</strong> home page with the <strong>Status</strong> set to <strong>configured</strong>, but is not yet available to any users, except the developer on the <strong>Developer</strong> tab in the Bot Store. When you publish a Bot task, you are actually initiating a request to a Bots Admin to approve and deploy a task. Depending on the <strong>Purpose</strong> defined for the Bot on initial setup as:<ul><li><strong>For internal employees only</strong> - The Bots Admin must approve and deploy the Bot task, and then explicitly select managed users to assign the Bot task to.</li><li><strong>For everyone</strong> - All domain users, managed and unmanaged, can use the Bot immediately after the Bots Admin approves and deploys the Bot task.</li></ul><a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/publishing-tasks/'>More...</a>",
	"bb040":"<div class='stepsTitle'>Create Standard Bot</div> <p>Standard bot is a general purpose bot that can be populated with tasks that it can do. </p><ul class='steps'><li>Target audience can be set to only individuals within your enterprise with Bot Admin assignment functionality or it can be a publicly available bot for all users which needs no user management.</li><li>All types of tasks can be created in a standard bot.</li></ul><div class='stepsTitle'>Create Universal Bot</div><p>Universal bot is a bot that can host other bots inside it and access all the task functions of its child bots.</p><ul class='steps'><li>Universal bots do not have tasks themselves.</li><li> Create a universal bot only after you have created two or more standard bots.</li></ul><div class='stepsTitle'>Install Sample Bot</div>Sample bots are collections of bots that can help you learn how chat bots work or speed up your bot development.<ul class='steps'><li>In the builder tool, you can get copy of sample bot in to your account to access all parts of that bot</li><li>Customize installed sample bot for your need by providing required configurations</li></ul>",
	"bb041":"The <strong>Collection Name</strong> is displayed to the end user when bot actions are listed, so use a name that relates to the question category that the bot responses will resolve. <a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/defining-bot-tasks/knowledge-tasks/'>More...</a>",
    "bb043":"The name of your Bot task should describe the user intent, for example, <em>Create Ticket</em> or <em>Get Weekly Calendar. </em>The name should:<ul><li class='p1'><strong>Be relatively short</strong> - Only one or two words. Just enough to identify the Bot uniquely, but not require a lengthy user input.</li><li class='p1'><strong>Not have punctuation</strong> - Do not use punctuation, hyphens, underscores, or any special keyboard characters. The only real exception to the 'no punctuation' rule is a name like <em>flowers.com</em> since everyone recognizes and remembers periods in a web-name, pronounced as <em>flowers dot com.</em></li></ul>",
    "bb044":"<ul class='steps'><li><a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/dialog-tasks/'>Dialog Tasks</a> - Use to design a complex conversational flow between a user and the bot with multiple component nodes and sub-intents.</li><li><a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/notification-tasks/'>Alert Tasks</a> - Monitors a web service for events and then sends a notification message to the user when the event occurs. You can use this task type for scheduled polling or for near real-time notification using webhooks.</li><li><a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/defining-bot-tasks/create-a-report-task/'>Information Tasks</a> - Provides a report of data by asking the user for input parameters and then executing a web service call. The formatted data is presented to the user as a link to a report that a user can click to display the data, for example, <em>Show my tickets</em>, or <em>3-day Weather Forecast</em>.</li><li><a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/kore-bot-action-tasks/'>Action Tasks</a> - Use this task to query a user on demand for input parameters, and then execute a web service call along with a confirmation message, for example, <em>Create New Ticket</em>, or <em>Get Weather for this Location</em>.</li><li><a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/knowledge-tasks/'>Knowledge Tasks</a> - This is an artificial intelligence-enabled task that provides bot responses to user questions not involving an API call, for example, <em>What is your name</em>, or <em>How old are you? </em></li><li><a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/creatingflows/'>Creating Flows</a> - Associates one task to another task of the same or different Bot. For example, a flow for a <em>Twitter</em> tweet notification could be to <em>Create New Follower</em>.</li></ul>",
    "bb045":"<p class='description'>The Message node is a component type in a dialog task used to display a bot response message a user. You should use this node type following an API, web service call, or webhook event to define the results as a formatted response to the end user. Based on the user input to the message, you can define conditional transitions to continue the dialog task to next node. <a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/defining-bot-tasks/dialog-tasks/working-with-the-message-node#message'>More...</a>",
    "bb046":"The Entity node is a component type in a dialog task used to capture input as an utterance, selection from a list, free-from entry, or even a file or image attachment from a user. Entities are stored and used in the flow either to execute a task as part of an API call, or to specify a path in the task flow based on a condition. You can use this type of node to prompt a user for input, such as a location, address, or account number to be used as a parameter for an API request to get the information needed for the user intent for the dialog. <a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/defining-bot-tasks/dialog-tasks/working-with-the-entity-node#entity'>More...</a>",
    "bb047":"The Service node is a component type in a dialog task that you can use to add an API service to make REST or SOAP requests to third-party web services. You can use this node when you have collected the parameters needed for the API request using Entity or other nodes to capture the user input. You can define the Service Type for this node as one of:<ul><li><strong>Custom Service</strong> - Define an API request to a third-party web service. This is the default setting.</li><li><strong>HTML to Image</strong> - Define HTML to render as an image using JavaScript. For example, you want to compose HTML or the value of a key in a web service response contains HTML markup as a string that you want to convert to an image.</li><li><strong>URL to Image</strong> - Define a web page URL to load to render an image.</li></ul><a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/defining-bot-tasks/dialog-tasks/working-with-the-service-node#service'>More...</a>",
    "bb048":"The Script node is a component type in a dialog task that provides the ability to write JavaScript code in the dialog task flow. You should use the Script node when:<ul><li>Input parameters from a user must be manipulated before executing a API call</li><li>Response parameters from an API response payload must be manipulated before continuing the in the dialog task flow</li><li>Custom error messages must be displayed to the user</li><li>A decision must be made based on complex business rules.</li></ul><a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/defining-bot-tasks/dialog-tasks/working-with-the-script-node#script'>More...</a>",
    "bb049":"The Web Hook node is a component type in a dialog task that you can use for server-side validation, execute business logic, or make backend server API calls. When you create a Web Hook node, you can subscribe to message and web hook events. In addition, you can use the Kore.ai SDK Tool BotKit to add event handlers and control the messages and web hook events as required by connecting the Web Hook node to a Script node and writing the JavaScript logic to process the response. You can use this node type to capture real-time events and display the data to the end-user. <a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/defining-bot-tasks/dialog-tasks/working-with-the-web-hook-node#webhook'>More...</a>",
    "bb050":"The Confirmation node is a component type in a dialog task used to display a bot query message to a user and then wait for a user response. The conditions defined for transitioning to the next node in the flow are based on the user response to the bot query. You can use this type of node to capture user approval for a choice, for example, <em>Do you want to transfer $25 to your savings account? </em><a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/defining-bot-tasks/dialog-tasks/working-with-the-confirmation-node#confirm'>More...</a>",
    "bb051":"<p class='description'>Although a dialog task always starts with a User Intent node, the task can contain multiple optional intents in addition to the root intent. For example, in a dialog task with a root Intent node to Find a Branch of a bank, once the branch is located, the optional intents could be to find a branch that sells stamps, or has an ATM.</p>",
    "bb052":"",
    "bb053":"Flow tasks link a message response from one task to another related task of the same, or different bot. You can create flows between different Bots from action tasks to action tasks, alert tasks to action tasks, and alert tasks to dialog tasks. <a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/defining-bot-tasks/creatingflows#flows'>More...</a>To map dialog tasks to other dialog tasks, or to sub-intents within the dialog task, you must use conditional transitions. For more information, see <a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/defining-bot-tasks/dialog-tasks/creating-dialog-task-flows/'>Creating Dialog Task Flows</a>.",
    "bb084":"Type a user utterance...",
    "bb085":"PRO TIP: Type your utterances with a reference to the intent as well as any entities you want to include. The best testing and training occurs when you type the utterances as naturally as possible.",
    "bb086":"Test & Train your bot to understand different user utterances and match them with intents and entities. Training allows you to look into the mind of your bot and fine tune how it understands its users and train it if necessary.",
    "bb500":"you can view and adjust the confidence level percentages for the task in one of three ranges as:<ul><li><strong>Not matching a task</strong> - The gray area represents the knowledge task NLP interpreter confidence levels are too low to match the task intent.</li><li><strong>Multiple matches for a task</strong> - The orange area represents the NLP interpreter confidence levels range from minimum to maximum that provide one or more matches as a list of task intents to the user to choose from.</li><li><strong>Matching a task</strong> - The blue-green area represents the NLP interpreter confidence levels range from minimum to maximum required to provide an exact match to one knowledge task intent.</li></ul><a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/optimizing-bots/task-identification-settings#level'>More...</a>",
    "bb502":"PRO TIP: Specify the type of connection for your task. One of:<ul><li><strong>Webservice</strong> - The web service sends data to Kore when polled by Kore using the end-user account log on credentials. This setting is read-only for action tasks.</li><li><strong>RSS</strong> - The web service returns RSS feeds when polled by Kore, and may require end-user log on credentials.</li><li><strong>Webhook</strong> - The web application pushes data to a task URL endpoint provided by Kore.</li></ul>",
    "bb503":"PRO TIP: This is the communications protocol connection type for your task as a web service. The web service sends data to Kore when polled by Kore using the end-user account log on credentials.<ul><li><strong>REST</strong> - The task uses a REST API connection that is protocol-independent to exchange messages and to handle CRUD operations for web services.</li><li><strong>SOAP</strong> - The task uses a SOAP API connection based on XML protocols for message exchange.</li></ul>",
    "bb504":"Select <strong>Yes</strong> to disable confirmation of the execution of a task when using NLP. When <strong>No</strong> is selected, the user is asked to confirm the task before running it.",
    "bb506":"Enter a <span style='color: #0000ff;'>www.youtube.com</span> link, for example, <a target='_blank' href='https://www.youtube.com/watch?v=qB3P7kDKXZ4'>https://www.youtube.com/watch?v=qB3P7kDKXZ4</a>, to display a task demo icon next to the task displayed in the Kore.ai <a target='_blank' href='https://bots.kore.ai'>Bot Store</a>.",
    "bb507":"The base URL for the Bot that the end-user must specify their company to complete the tenant-specific URL using the following syntax: <span style='color: #0000ff;'>https://{tenant}.someWebService.com<span style='color: #333333;'> where</span> {tenant}<span style='color: #333333;'>, including the braces, represents the tenant name. </span></span>",
    "bb508":"Specify one or more search words an end-user can use to help locate this task in the Kore.ai <a target='_blank' href='https://bots.kore.ai'>Bot Store</a>.",
    "bb509":"The Kore.ai Connector Agent can be used to establish and maintain secure data connectivity between cloud-based Kore.ai Bots and your on-premises Bots application. Using an on-premises Bots application, communications security is maintained by restricting users and systems within the company intranet or by configuring specific channels for specific data exchange.If your domain does not have any active Kore.ai Connectors defined, a warning message is displayed to contact the Bots Admin Console system administrator. For more information, see <a target='_blank' href='https://developer.kore.ai/docs/bots/adminconsole/security/using-the-kore-connector/'>Using the Kore.ai Connector</a> in the Bots Admin Console documentation.",
    "bb510":"In the <strong>Authorization Check URL</strong> field, optionally define a URL that can be used to test the authentication settings from Bot Builder before you deploy the Bot with the authorization mechanism. You can use dynamic fields, path parameter fields, query fields, and so forth, to define the test URL, for example,<span style='color: #0000ff;'>https://kore.someCompany.com/sap/opu/odata/sap/{{authfield1}}/?$format=json</span> or <span style='color: #0000ff;'>https://{tenant}.service-now.com/api/now/v1/table/incident</span>For more information, see <a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/defining-bot-tasks/using-session-and-context-variables-in-tasks/'>Using Session and Context Variables in Tasks</a>.",
    "bb511":"This is the URL used to obtain end-user authorization for the Kore.ai application to access the web application or web service using the access token. This field is required. You can use dynamic fields, path parameter fields, query fields, and so forth, to define the Authorization URL, for example,<span style='color: #0000ff;'>     https://kore.someCompany.com/sap/opu/odata/sap/{{authfield1}}/?$format=json</span> or <span style='color: #0000ff;'>     https://{tenant}.service-now.com/api/now/v1/table/incident</span>For more information, see <a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/defining-bot-tasks/using-session-and-context-variables-in-tasks/'>Using Session and Context Variables in Tasks</a>.",
    "bb513":"If the default username and password fields do not meet your needs for authorization input, you can add custom fields as key/value pairs that are displayed to the end-user by adding <strong>Additional Fields</strong>. You can use these fields, for example, if a PIN code is required in the authentication process, in addition to the <strong>Username</strong> and <strong>Password</strong> fields.",
    "bb514":"Select to disable key transposition by Kore.ai. By default, Kore.ai transposes a key/value pair, for example, <code>'parameter':'value'</code> is transposed by Kore.ai to <code>'parameter:{value:'actualValue'}</code>. When selected, keys are not transposed by Kore.ai and passed in the response as received.",
    "bb515":"In JavaScript, you can fetch data from the session data using session variables. For example, you can GET the user ID using <code>context.session.UserContext.identities</code>, and then PUT the data into <code>context</code> For more information, see <a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/defining-bot-tasks/using-session-and-context-variables-in-tasks/'>Using Session and Context Variables in Tasks</a>.",
    "bb516":"On the <strong>Advanced</strong> tab of the Prompt editor, you can add custom code to handle the user prompt message using system and session variables. For more information, see <a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/defining-bot-tasks/using-session-and-context-variables-in-tasks/'>Using Session and Context Variables in Tasks</a>",
    "bb519":"Processors are use to manipulate data collected in the user session before, during, or after an API request to a web service using JavaScript.If a processor is defined and sequentially placed before the API Request, it is a pre-processor. Pre-processors can be used to manage your input parameters and values from session variables before the API Request is made.If the processor is sequentially placed after the API Request, it is a post-processor. You can use a post-processor to access payload response keys from the API request. To access keys, use one the following post-processor types:<ul><li><strong>Resolve</strong> - To use the results of one payload response as input for a second request.</li><li><strong>Spread</strong> - For payloads that contain arrays of data that you need to separate.</li><li><strong>Extract</strong> - For payloads that contain multiple objects, you can specify a path to the specific object.</li><li><strong>Assign</strong> - Using the <strong>Assign</strong> processor, you can specify a variable name for the payload response.</li></ul>",
    "bb524":"After you add your filters for the response object, you should determine if you need to apply a strategy to prevent the display of duplicate messages to the end-user. For example, if you set up an RSS task, you may want to prevent duplicate messages for the same subject, or for <em>Facebook</em>, prevent duplicate messages each time a comment is added to a post.In Kore.ai, you can choose one of two options for <strong>Deduplicate Strategy</strong>:<ul><li><strong>None</strong> - This is the default method to prevent duplicate alert messages. Each<span class='s1'> incoming task payload is hashed and the latest 500 task hash values are persisted. Each new task payload is compared against the list to prevent duplicate task alert messages. This option works for most tasks.</span></li><li><strong>ExcludeByCachedIds</strong> - Select to enter one or more response identifier keys in a comma-separated list used to filter Kore.ai task alert messages and prevent duplication based on the cached hash value of the key for up to 500 hash values. If any of the key hash values match the response object, then the alert message is filtered and not displayed.For RSS <strong>Alert Types</strong>, RSS XML payloads are parsed as JSON. To filter by RSS item, enter <code>$..guid[0]._</code> to prevent duplicate messages using the XML &lt; <em>GUID</em> &gt; tag parsed to JSON as:<pre class='toolbar:1 lang:default decode:true '>{'guid': ['_': 'some link']}</pre></li></ul>",
    "bb525":"If the default username and password fields do not meet your needs for authorization input, you can add custom fields displayed to the end-user by adding authorization IDP form fields. You can use these form fields, for example, if a PIN code is required in the authentication process, in addition to the <strong>Username</strong> and <strong>Password</strong> form fields.",
    "bb526":"When selected, the end-user can enable this task to run automatically. For example, when an alert message for <em>Crashlytics</em> indicates a server is down, using the predefined mapped fields, a <em>JIRA</em> ticket can be automatically created without additional end-user input provided all required fields are mapped.",
    "bb528":"In Kore.ai, you can create and use knowledge tasks to enhance bot recognition performance of user inputs, and also to create and import FAQs. When a user makes an input, Kore.ai will search knowledge tasks first and look for user intent. If a user intent does not match any knowledge tasks, then Kore.ai continues to search other tasks, for example, action tasks and alert tasks.Knowledge tasks are designed to respond to user input without having to make a call to the web service. For example, a user may ask, <span style='color: #0000ff;'>What is your name?</span> or <span style='color: #0000ff;'>Why doesn't this work?</span> You can define multiple versions of the same questions, as well as multiple answers as shown here:<ul><li><strong>Questions:</strong> <em>What is your name, Who are you, What are you called, Do you have a name</em></li><li><strong>Answers:</strong> <em>Kora, Kora Bot</em></li></ul>You can use knowledge tasks as your enterprise FAQs, and import new, or update existing FAQs by uploading a file. <a target='_blank' href='https://developer.kore.ai/docs/bots/bot-builder/defining-bot-tasks/knowledge-tasks#knowledge'>More...</a>",
    "bb529":"Pro Tip: You can use any value that is currently stored in <code>context.</code> in your message construction with {{variable brackets}}. Example: 'Hello <code>{{context.session.UserContext.firstName}}</code>. How can I help you'",
    "bb530":"Creating the right prompt messages are an important part of creating a convincing, fun to use bot. Keep the following tips in mind as you create these messages.<ul><li>Create more than one prompt message so that the bot can randomly choose one. This will give your bot a less robotic feel when interacting with its users.</li><li>Include any context variables into the message as needed so that the user can always fully understand the information the bot is asking the user for.</li><li>Keep prompt messages simple, short and to the point, as possible. As the user uses the same function over and over, you don’t need the user to do as much reading.</li><li>Use channel specific messages with JavaScript and JSON to access advanced functionality of those channels. eg: Facebook Messenger’s quick replies or button templates.</li><li>When one or more channel specific messages are present, the randomizer will only look for other messages for the same channel.</li></ul>",
    "bb531":"If more than one prompt message is defined, one will be picked at random at runtime. If one or more channel specific message is provided, only those will be considered for that channel. The ‘All channel’ prompts are ignored when a channel specific prompt is found.",
    "bb532":"Keep the following tips in mind as you create response messages<ul><li>Include any context variables into the message as needed so that the user can always fully understand the information the bot is asking the user for.</li><li>Keep response messages simple, short and to the point, as possible. As the user uses the same function over and over, you don’t need the user to do as much reading.</li><li>Use channel specific messages with JavaScript and JSON to access advanced functionality of those channels. eg: Facebook Messenger’s quick replies or button templates.</li><li>When one or more channel specific messages are present, the randomizer will only look for other messages for the same channel.</li></ul>",
    "bb533":"You have untrained utterances in your machine learning model. Unless the engine is trained the bot will not identify intents and entities based on the un-trained utterances. Click on ‘Train’ button to update the bot with all your utterances.",
    "bb534":"You have untrained utterances in your machine learning model. Unless the engine is trained the bot will not identify intents and entities based on the un-trained utterances. You may initiate training for these utterances once the current training in progress is completed.",
    "bb535":"For better speech recognition, it is suggested that you train the Kore.ai Speech engine with bot utterances. You can use the utterances used for Machine learning training to train the speech engine. Try training now from Machine learning page.",
    "bb536":"Kore.ai App registered for SDK events will be used for Agent Transfer events as well.",
    "bb537":"Pro Tip: You can use any value that is currently stored in <code>context.</code> Example: <code>print('Hello'+ context.session.UserContext.firstName+ '. How can I help you')</code>",
    "bb538":"Callback URL defined here will be used for BotKit SDK and Agent Transfer.",
    "bb539":"Generate only the 'response' element to be included in the payload to Alexa. All additional elements required are generated by the platform before delivering the final payload to Alexa.",
    "bb540":"Kore.ai App registered for Agent Transfer will be used for SDK events as well.",
    "bb550":"Use the following command to switch language within a session. <br><code>  cheat language &lt;language_name&gt; </code> <br> E.g. cheat language En to switch to English language",
    "bb551":"<ul><li>Importing bot definitions from different bots into a single bot could create conflicting data and your bot may not function as expected.</li><li>Platform implicitly creates relationship between various components of source and target bots during import. Subsequent upgrades will refer to this relationship for determining components to upgrade. To ensure continuity of your subsequent upgrades, always import definition from same source bot.</li><li>Do not manually add or modify tasks of this bot after you have upgraded it using another source bot definition. This will ensure that you do not lose any of your work during subsequent upgrades.</li></ul>",
    "bb552":"If you have previously imported another bot definition into this bot, ensure that you are upgrading this dialog using definition of corresponding task in source bot. You may also consider upgrading the complete bot by migrating the definition of the source bot.",
    "bb553":"Creating the right error messages are an important part of creating a convincing, fun to use bot. Keep the following tips in mind as you create these messages.<ul><li>Create more than one error message so that the bot can randomly choose one. This will give your bot a less robotic feel when interacting with its users.</li><li>Include any context variables into the message as needed so that the user can always fully understand the information the bot is asking the user for.</li><li>Keep error messages simple, short and to the point, as possible. As the user uses the same function over and over, you don’t need the user to do as much reading.</li><li>Use channel specific messages with JavaScript and JSON to access advanced functionality of those channels. eg: Facebook Messenger’s quick replies or button templates.</li><li>When one or more channel specific messages are present, the randomizer will only look for other messages for the same channel.</li></ul>",
    "bb554":"If more than one error message is defined, one will be picked at random at runtime. If one or more channel specific message is provided, only those will be considered for that channel. The ‘All channel’ prompts are ignored when a channel specific prompt is found.",
    "bb555":"The intent was not successfully identified for the above utterance. Select an intent below to begin training the bot to understand this utterance. To correct this unknown identification of the user’s intent, first select the correct intent for this utterance below.",
    "bb556":"Oops, multiple intents are identified for the above utterance. Select an intent below to begin training the bot to understand this utterance.",
    "bb557":"You are currently publishing your bot(s) under our free trial program and plan with certain usage restrictions.",
    "bb558":"To publish your bot(s) for commercial use, please enter specific bot usage information and submit your request"
    
}

